[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
4804
6362
5371
4278
1888
945
3308
3318
2199
2074
2011
2371
4089
5221
2123
2536
5263
94
790
2892
1633
6570
3754
3926
1440
7461
247
5528
3421
3857
5267
405
3549
2684
612
5140
2957
4322
2049
315
1886
74
4304
966
1802
4773
3334
5915
5814
2785
5384
1184
6248
3144
5524
309
936
964
308
1007
1498
5911
1868
606
4576
4839
4094
690
2252
95
4608
4702
4358
5426
5819
5032
4113
2619
355
638
2929
7093
806
2856
6208
3321
7032
2639
6666
6657
3922
2110
4900
6176
5366
7171
3736
6990
2538
5997
6174
2790
2967
4021
6099
1597
3470
5031
5805
1716
5451
7044
1593
7314
2733
7072
6261
6968
4699
6867
6324
4737
6602
703
2758
6074
5823
5731
7180
7362
5695
4851
4044
3362
7384
3097
1825
1246
228
6313
789
3898
6364
4073
2233
7435
983
411
3464
346
4111
6314
3204
28
6954
252
5424
3061
7470
600
7152
6680
6377
6864
3136
2807
2719
1789
347
4824
3001
2102
1461
333
2722
3055
3793
5769
6312
961
282
5352
791
3327
3825
6441
3581
1508
5082
5779
5518
298
6996
4956
7319
3579
6583
285
3049
7526
2402
165
3135
4442
3480
5788
23
290
4109
5092
6252
395
2360
2128
1423
801
4779
1369
5801
1528
6880
4412
5000
4336
6203
4003
3629
880
4409
1862
4177
4813
6855
3508
6883
6807
4596
5759
1942
5047
6443
2378
3671
4076
3592
6335
1850
2043
5811
5943
1940
4604
3512
3100
7169
7063
2356
2724
4564
2787
5268
2651
5822
7250
6090
3769
6100
6776
128
2065
5074
2060
4626
3797
4129
6512
636
6368
2154
6165
3943
2138
3331
7522
1863
529
6519
6622
5511
1040
3254
6616
719
5431
4233
4912
5668
1986
5362
794
641
6134
2655
5354
4581
496
4031
2254
1644
6226
2092
2354
1798
7429
2015
6017
3993
3804
2540
950
6923
4708
2877
10
7546
4364
115
1601
6022
6546
7354
4321
174
3173
6004
1871
6675
6822
5786
4399
7226
5327
2703
4486
2394
7333
3526
532
457
2530
5248
7119
3657
2424
3050
3138
6914
1202
4286
5343
1724
7162
770
817
3760
257
5051
720
682
2618
5653
5163
1373
3369
6632
2357
5900
3248
3990
7403
2917
6525
5462
2493
693
148
4512
1107
1882
2488
4752
3048
4179
2625
5865
4934
6107
3738
6758
3128
585
898
2960
2009
2948
5308
1454
5688
160
3271
645
709
3413
215
5926
4857
5273
1712
3035
2521
608
4013
455
4091
5180
1500
2175
443
4693
4863
4756
307
3338
3382
5820
6926
6861
1515
862
2928
4007
3646
5113
6596
7239
268
3286
5634
2019
3015
7134
1872
2183
3300
4668
4251
7312
958
2819
5893
112
2863
5981
851
1522
1641
5128
2021
6551
4371
6401
3517
3795
3640
1630
6744
2826
3429
2155
5553
2410
742
3217
4680
6200
959
6554
6700
5461
4781
7536
2470
6394
7330
2567
398
4632
6915
6717
611
7300
5792
5987
3627
2073
2066
4807
4652
6490
1742
5374
4476
2339
3391
4458
5717
2249
1256
2471
7031
3821
101
3525
5044
169
7289
3373
1272
6649
4548
4008
4600
5271
3548
6590
1053
2721
3673
3547
4355
445
3417
260
1800
3432
3179
4733
5574
7442
6963
2702
3484
734
6353
5089
6227
3988
3999
1573
510
3602
644
4176
3492
266
836
486
5284
231
137
1758
2974
4913
6658
3137
1558
3998
5728
5210
4492
5852
5455
3914
3824
7245
5585
3208
5045
4732
3412
4631
19
3950
1268
2851
7085
6589
5482
2239
4528
5192
4260
1713
6810
5037
3659
7284
4289
5864
2745
4911
5771
6158
2158
5760
4915
3861
6199
4041
1879
918
808
1295
7036
2096
6212
769
7531
2002
6750
7233
4185
5446
211
5406
2741
5631
1632
5053
5817
5080
3562
4539
4069
1970
736
5745
7187
1208
8
551
5964
1182
6958
5740
7486
5156
3401
7400
2843
2523
3016
6847
4643
848
6844
5484
5587
2235
757
5392
5269
3314
6515
2989
6586
3449
6381
5323
2512
1814
2675
2026
6336
3891
1527
4419
2288
2585
441
6154
5736
3731
1308
953
6407
1469
6298
1902
4249
6653
2718
3965
7098
4791
1912
4721
1032
6955
4531
6476
6320
5467
4966
4443
1075
1074
663
3008
3103
4788
5204
7142
7225
6126
2173
601
5580
3974
224
7211
4625
2712
321
6237
4451
7258
6351
3255
7039
5491
2201
1976
3057
6460
1859
5733
4894
5340
6778
4819
7390
2750
3746
955
7089
1730
6975
3320
3112
1157
2641
3582
3400
1177
4239
7139
4366
5347
4006
632
2775
6393
4555
3706
3773
1518
430
4707
1245
7338
2057
4964
1318
3676
4306
3013
3012
5561
4051
2665
6774
3211
621
576
3275
1331
5233
6611
6986
941
4607
1975
4298
2562
750
4825
6580
550
2163
7110
4527
4924
1005
1309
235
3966
7370
2515
6293
5602
3801
7482
3865
6950
1476
1547
3446
4860
201
3452
592
1878
2507
1935
3572
7107
1242
4481
4120
3148
3288
6504
4671
2008
3481
1096
2517
2287
1420
2705
5472
3196
6710
5979
6170
6882
3366
2425
5293
2821
7150
534
1488
7071
2099
3749
93
5738
2664
3991
196
4025
2243
5358
6556
2118
2583
1536
4500
5887
5083
6339
2385
5274
6036
6181
2420
177
692
1110
5546
1679
1045
3827
6112
5112
1278
5299
6132
1458
3925
3559
5729
5108
506
7388
7386
4034
1064
2468
4833
5146
225
4506
5257
1771
5312
4164
6878
361
6944
994
5017
34
4128
3471
6436
4270
1510
2502
5099
7009
4206
3978
6529
764
1926
2306
5909
3162
6891
246
7176
2143
4256
2459
2662
1650
421
7022
7228
3635
5412
6698
4140
6538
3092
5164
6038
3062
5601
3183
6015
2970
7175
4899
431
2486
3654
6016
1979
1889
5282
4524
3193
5824
2484
6641
5860
5266
2780
3519
508
5870
2644
1188
3577
7145
967
106
306
5106
5218
3264
2225
6874
920
6127
2216
3578
5739
5912
3281
1693
3867
1352
3705
949
4706
7331
2801
1576
4729
7160
7509
7513
6315
1449
7414
1642
1511
1404
7168
2906
7437
394
6852
108
4854
3520
4255
5600
1923
3252
4727
239
1525
6056
1253
4855
5494
7329
13
3847
7422
768
749
786
6642
1478
744
1675
1132
4624
825
2723
3287
4588
4552
2325
4782
6095
1972
7440
6138
5665
2113
1249
139
2497
1696
4920
6947
1921
6765
2439
4224
6569
3409
6494
5664
7060
850
5390
4390
3106
7096
952
3587
6142
69
1587
1121
3661
7254
6153
4485
3075
3312
1973
5934
7164
5464
5240
1658
1939
5365
6769
6135
205
5068
5572
7285
6687
5757
2328
1953
2525
241
5309
2159
7
4195
89
980
3897
1864
4651
1727
7224
3918
6572
3505
2822
6826
2874
5196
2445
6216
1546
6818
957
1666
2334
3886
3844
1275
3811
4557
7408
4203
6119
3228
5157
2329
1645
3364
4382
3304
6754
1012
2310
7494
3110
1605
3767
320
7114
6626
891
4427
6124
5647
810
2978
2234
2209
4559
4958
4208
6363
7100
7013
1711
6833
6065
889
1453
1581
2237
581
5937
6456
1955
7067
1595
58
2981
3575
6753
2491
1142
2678
318
2987
6014
5136
1041
1772
4861
6743
3852
1008
2793
2773
1411
4058
7427
6405
5022
4216
2399
4889
3420
5684
5948
6527
5744
6424
2323
4305
1277
6325
6234
5223
4664
5381
4460
3037
46
5147
4790
3477
182
4723
5355
5103
4565
2936
5256
87
2408
4279
2268
4614
75
4191
1615
590
4244
2666
2701
973
5058
5162
7159
1201
4595
6865
3231
1076
7247
6965
3733
2294
7472
3430
6612
4027
4300
5952
5283
4682
7181
6477
5932
6492
2426
1489
7383
1930
5483
6940
2815
6262
2713
2772
974
4873
5454
1647
3761
2835
5018
3615
6063
2776
1366
149
633
6383
323
7415
116
5121
7135
388
3333
2647
4919
5152
5184
4398
1314
4622
906
4578
7302
5422
20
4688
4334
6829
2212
7132
2988
707
5261
2614
4175
1682
5812
7469
5005
6631
4742
5124
5516
2466
6067
4616
656
2531
1367
1836
543
7282
6247
4901
5399
3151
5041
2673
3177
5478
6870
2198
6941
7371
4430
6438
2226
4676
4918
4885
6151
3108
416
6792
210
6343
370
1505
419
727
2965
7402
131
1340
3351
7046
5702
2566
5277
3813
3198
365
4425
3460
5512
349
1584
4789
1191
6189
4148
3186
660
549
1913
2261
4515
1176
1391
7263
5357
6461
6403
1251
680
3113
2940
4644
4904
4712
2292
3989
4291
5333
905
3133
1260
1916
7373
2436
3742
4394
3032
4237
1183
5289
6222
4968
5486
2035
3376
5843
1222
2462
5685
7173
4411
677
3789
1808
6815
1639
3849
3675
7193
4475
5245
2331
5471
6528
826
6279
5322
3856
1427
133
5382
7287
6086
5262
4339
5138
4945
7346
3679
6571
4580
5621
4077
2077
2397
67
3685
2320
6020
250
711
6918
2231
4056
6246
522
3265
168
4689
1918
1514
1788
2345
494
2018
1945
5960
5394
4259
1140
2101
1014
4959
4979
6978
7398
4284
2458
2490
5832
3435
1706
2305
2802
4501
4030
7003
6922
6211
5840
2637
6609
5701
2352
7197
226
7459
3794
4283
1532
5525
4144
3174
3778
5496
5189
4388
821
923
237
6723
4235
2516
4551
300
5556
3040
5873
7541
1413
3593
2456
1071
4741
864
5794
1740
3904
2556
7537
3246
5859
3770
1623
3725
1896
2805
5503
3247
5807
701
3750
5519
5093
477
6517
627
1200
4602
4362
4281
162
1226
1426
7375
2390
1009
3475
5169
3258
476
3171
741
7456
4478
244
4987
3975
1664
5135
1241
1818
4962
565
683
3957
7002
2274
155
7452
3431
4271
7217
4858
6431
1414
1797
6402
842
960
173
6904
185
6871
7047
4218
7177
4852
2452
3718
4628
2307
3357
5549
5898
3748
3534
4907
2845
3490
151
6190
4840
4368
5118
4379
4801
3105
698
1472
3114
4011
4053
2172
4166
1306
2078
16
1855
7387
2379
4747
784
6932
3309
6640
5126
2971
1002
6691
6552
4174
240
6295
3085
4678
1486
7209
3269
459
7069
2338
2911
2284
2372
4464
4832
2594
3834
498
2899
4440
1761
2148
6593
1659
4182
5527
855
4977
3439
4535
5970
4252
3392
2067
2734
3864
4100
3411
5225
6418
2555
6219
1247
432
7478
3532
5109
6639
27
1984
4171
4994
7242
5010
1555
5520
1346
1783
4641
6350
4000
1156
2959
1860
4075
6828
615
2405
145
4619
540
4405
2481
453
7294
2134
3881
5306
6002
1826
3010
4638
6659
4884
7051
815
3451
5350
2342
3326
7310
3571
1849
6068
5493
5714
2654
4359
1755
2303
4774
6196
6654
4772
3696
1180
5506
1344
2528
1466
6759
7010
5547
4169
4477
7534
3732
4691
4618
3800
1437
1754
4563
4766
4726
6430
4705
77
2446
5703
1661
62
5376
2196
2496
3191
1285
1446
2260
2041
2083
6628
1387
2769
6169
3299
4757
6347
4211
2922
2642
7147
7395
5313
1557
4927
1517
3491
2391
4902
1937
1028
2186
4659
4245
4311
4320
4777
1839
92
7140
6497
6159
870
2937
2229
3166
1442
2150
3637
3090
925
5387
3910
1668
2358
7118
7146
1732
3624
1667
813
3528
4829
731
3626
1899
5895
4597
3907
2912
3522
7349
7138
5955
6183
4269
1989
5292
5613
4125
778
4826
1382
2634
3996
2878
209
6988
5238
4722
4002
2840
4886
6983
5095
3234
2068
7344
1697
5120
104
4890
6775
4117
2263
3935
2343
3026
2253
754
5920
2657
150
1089
3783
4601
872
2267
4866
6451
3807
3669
4583
5715
1252
7223
4266
2617
5954
7196
2013
6096
2480
1774
141
4834
5841
6763
1438
4820
640
7130
5107
2156
1903
2170
4505
4004
5430
4001
2107
5507
7025
1768
6384
1230
6000
4469
5907
3912
3934
7406
588
172
5133
4562
5230
1852
6411
4421
5286
702
493
854
2171
5635
3933
1640
1585
5088
6453
3665
4662
3947
499
2650
5141
3345
3000
3663
114
1801
377
5071
837
461
4523
4701
3131
3127
1702
885
5591
3270
2181
6597
4768
7040
2414
595
1384
5643
6395
1746
5618
6428
3625
3445
6184
3033
4264
4594
3656
991
3021
1977
5229
5857
2680
4210
460
3684
5020
3809
728
1126
5555
5040
852
4325
6782
7356
2889
1482
1451
121
4416
5228
3941
4635
4550
3805
5028
2896
7151
2317
5328
230
5260
3051
5237
4972
4639
1501
5383
4327
4098
1938
2415
6681
4736
890
740
2862
4976
4591
4466
7054
5481
4181
5785
2871
4026
1520
2694
208
4725
9
2615
5944
409
2672
277
6938
5930
1347
5931
6952
653
4457
6198
3091
7313
3257
3381
6120
4071
4769
7483
4099
5667
6781
1065
2126
6929
730
5134
5359
3744
2754
6444
3995
1786
1673
3670
1228
434
1170
3200
2418
5615
7053
284
2440
5186
324
1654
5470
4138
5129
4811
50
696
2958
4687
1153
2888
6069
2836
7327
4047
3604
2746
1643
86
3210
4633
5648
579
3708
7441
7141
6816
5166
3501
4494
3485
3937
1822
1304
7062
5009
1887
3324
3618
6718
4507
478
6292
6942
4574
3238
6046
7436
3622
3450
190
5533
5502
1004
4498
6621
5149
5939
4450
1815
3662
3041
541
5199
5265
5990
3116
1209
2246
4391
5697
4793
283
762
7548
5105
4874
695
6168
3098
5834
1967
1439
1753
3743
5938
5072
7521
2080
4950
7493
2189
233
6397
6400
5016
2526
3483
1052
4648
2532
2377
5178
3086
4085
6899
4410
4679
6445
3774
5411
2945
7103
3292
6501
1559
7431
1790
4121
3181
722
675
6733
2510
1914
5654
2046
1424
5202
99
753
3648
1018
2031
4995
6647
340
6114
3970
2646
1873
3397
5562
4172
5391
5686
3111
232
984
2396
2176
2753
7272
2983
3206
220
4891
931
4677
2069
2596
7129
2534
2368
6210
6110
5013
4134
2047
5632
2063
2364
2667
1169
5064
6821
6264
6081
7527
452
4186
2692
6373
4147
5348
5705
5385
5356
538
1550
521
96
3817
2393
5847
4103
5006
2492
3053
5161
570
2640
369
1321
4277
43
5505
3031
1131
3003
5973
3976
256
816
1324
119
593
4930
7348
1421
1046
437
5060
1024
1212
5187
187
3341
38
1782
5991
2683
562
3159
5946
875
6962
714
6480
7202
6633
2467
1787
4062
5402
4570
4313
1773
1092
5264
2590
5086
4503
3161
3600
6937
4445
3456
4558
3543
32
6235
6094
7298
1621
1963
1493
7184
4467
4227
3741
5677
6053
2324
7200
4993
4547
3687
3987
7042
6416
800
331
7109
6334
2336
4454
5833
3408
1445
3798
4669
2147
7464
1965
4131
849
5307
5444
5548
1503
5810
6037
1548
3368
312
1543
7084
4686
5570
4052
3060
7064
6553
3503
1019
5607
6646
2206
6317
469
503
2522
6192
4472
7101
7257
572
2729
4554
650
2747
2581
2858
2558
832
2794
1631
429
4407
1060
4265
5611
6041
163
2629
3677
6858
4965
6439
2362
5983
4067
4101
6296
2669
4431
752
6440
3845
7320
5254
1322
4393
2389
7205
5144
7336
2557
4153
3846
5465
2943
4803
926
2548
5015
4997
829
3025
5663
2520
326
3557
1316
4568
735
5598
7377
6651
4232
3455
3969
5751
433
761
725
6238
3469
6442
3979
513
6800
2690
2028
2100
1709
392
84
4634
7466
5258
1390
2443
2258
7323
4297
2635
5899
3405
4141
4571
245
909
2160
5222
1349
2921
6727
3680
181
1577
5640
6236
6523
3546
5182
2266
1474
5305
4868
6465
7505
4016
7121
305
6534
5641
6508
2012
4200
6128
4954
6163
5849
3390
4123
4544
1714
6358
1551
4426
878
3727
4490
4537
6410
4763
5155
5599
6840
3019
3838
5921
3946
3158
1141
1700
5198
6287
3531
1323
7015
1173
7229
6207
2477
278
3875
3551
2630
6746
2759
7295
4190
130
1417
7288
4253
2938
655
3704
4250
5708
536
3282
894
2344
1220
4881
2668
699
6076
2902
4343
5974
5672
1795
3714
990
1240
4579
5235
1958
7277
5746
6256
1598
7454
1752
723
6974
1622
3877
1566
4254
2495
5637
6588
4012
2727
4613
1229
6757
448
2373
542
420
4827
3728
3758
6543
3945
6026
7379
6484
6011
1402
2890
4903
4716
1218
3267
2636
1365
5094
3924
6498
2608
6726
5619
1804
5993
2037
3971
7227
985
3574
6752
1686
1148
3735
6787
1057
3117
7236
6177
5517
179
5992
3639
7404
1877
3822
805
5438
269
2916
175
7443
2081
1310
2621
4429
3192
6229
2269
1671
5922
666
4295
2014
939
2691
6194
7328
7492
5749
4380
223
2648
2982
1497
3603
3099
1108
5477
3047
2770
1736
2716
6984
7322
1254
1115
1738
5844
691
5563
5883
5762
4502
3227
1146
6454
3595
888
7136
7501
4888
6623
4590
1844
5369
1513
78
1565
3499
4142
4397
4463
5791
4344
2211
3757
4783
5059
1281
1155
2812
2605
2779
858
7426
4222
6483
7419
24
7268
2597
1952
4862
4567
1588
5690
908
2259
2152
1856
4395
4420
6785
7430
4876
6500
465
3296
6141
2223
4314
5678
4167
6780
3149
1540
779
6329
2277
4082
4784
853
807
1066
6380
1363
4220
6542
2350
688
6742
3921
1015
2707
7179
3447
3459
2744
458
71
748
5889
5754
1219
402
341
1509
1507
3977
3403
5090
1764
586
5660
4204
3360
3610
6301
3649
6980
5320
3141
2327
6144
6603
5986
4704
4017
4045
512
3319
3830
1491
987
3084
6689
1920
6511
2576
2272
191
2483
6366
4367
4452
3220
1267
7364
6721
7381
814
1288
7489
5197
7520
6813
5183
6080
573
2380
5276
3611
2765
6893
7449
4883
2880
868
4096
4493
4401
3232
4942
2337
7016
6789
3740
5571
3363
4040
7292
6683
2559
68
2487
5940
5194
7222
2006
544
717
1541
3416
22
390
537
7544
4627
7156
4938
4532
2145
1778
6824
2660
819
6357
3836
2995
1428
6695
999
293
3014
1985
337
5904
2786
1988
4102
3011
2055
7545
1612
4961
4092
2544
605
2571
3154
3566
6917
367
584
7024
7218
1069
726
2376
3147
158
6876
7122
686
2537
3004
2465
4645
6240
3340
5510
1625
6093
1539
4168
5956
5219
7052
3389
7038
5687
667
3535
4989
6372
2374
6186
5253
2830
1203
167
5315
972
2800
4387
1021
2990
1674
5030
975
6548
4194
2616
2255
2423
5206
1432
345
6877
5597
485
1160
1109
1049
3580
5019
5658
2946
5676
1190
3908
1583
5246
7012
2778
4005
1733
803
3205
3388
5255
7019
2088
1419
670
7037
5485
2740
5882
2771
109
3442
3029
3453
7106
6420
217
2506
1591
4714
4698
555
3197
1422
6992
6652
2419
3952
5023
5848
597
6842
5073
6521
3273
6868
6346
2806
4739
4127
4941
4173
1946
2455
7511
1854
6919
5718
3415
4754
2311
2905
7017
1780
3874
2601
7399
7369
6987
488
3893
1383
3511
715
2169
5706
4229
799
771
7030
2842
3858
4800
6446
5803
3961
4014
827
2961
3620
1695
4132
2316
7451
3486
3538
6584
5125
4926
3940
6485
2369
6520
2867
3077
4720
7382
4988
329
1575
3356
2565
5442
694
2297
317
1354
4242
5617
5540
7185
5808
4299
4771
251
7341
4821
3367
381
3224
4865
6024
3605
5787
3497
773
6209
5962
7432
1840
2167
6719
4656
2121
6066
6458
914
3394
2034
4998
3776
5242
823
1271
559
2935
629
5829
5682
3168
7351
3462
6193
4243
893
5579
6943
6756
3963
79
4796
1280
189
5605
1359
3182
4683
6061
6435
3790
7462
5208
7444
6299
676
3810
6970
6425
3692
7273
6907
2044
4655
788
6502
3981
2036
4400
708
5079
4342
5557
3335
3869
6729
1590
3694
2188
1676
6398
7363
5042
3964
630
6906
2453
4823
6953
5002
5234
1544
5100
3325
7309
5190
3632
5346
539
5804
4893
3237
5772
1741
3509
1087
4474
7503
3711
2193
4963
1751
1450
1095
654
3959
4856
4039
5439
3516
2992
374
2029
343
2972
6890
7183
6175
1232
6834
2766
1138
1378
7076
26
5584
1418
2649
840
713
6582
6736
5968
5798
2228
5835
578
2849
7127
1827
6082
1885
661
423
4599
4480
4354
1336
5566
2007
7543
5949
262
5839
3911
2503
6619
316
3268
4162
2762
7519
553
3398
6897
3065
5419
2382
7007
2151
4569
1159
2600
5725
6697
6050
6863
6686
5288
2728
1692
2944
2671
6121
2873
1178
6859
6376
4718
3418
5361
1701
6838
7524
6130
631
5797
366
363
1485
5861
1974
1073
1656
1133
3251
6716
1111
5069
4897
3745
2924
4423
4929
7530
1670
3860
6739
5379
3855
2891
1224
4812
5846
2355
2852
6191
1823
1895
1043
3020
7490
2923
7190
3853
7367
4875
5625
238
1495
123
3378
3225
7420
5620
2885
6001
7115
2333
7056
2130
1552
2038
552
144
6949
896
1358
2349
2883
6007
3840
1607
2242
4504
646
6206
7213
3383
1905
5985
4969
3873
5285
4932
5061
1003
1663
901
5712
1473
2056
1199
7491
3285
2868
2302
5115
6352
2030
1638
1535
2279
4009
6738
1435
6832
940
5425
5408
4843
3895
3027
1698
371
839
4491
5213
6423
5033
3125
2489
4642
6318
2025
6048
5104
1685
1328
4231
947
1655
6031
2010
4917
4248
7365
3336
2860
7195
1302
4896
3756
7266
1022
7075
4280
4453
4479
3310
6496
6592
7423
4869
1039
4247
1572
5215
4533
408
4436
327
4922
3070
2168
4538
3597
2798
1250
525
2098
5310
1287
4780
6233
1719
6349
1353
6131
152
1444
3905
4158
1779
4119
4108
501
2230
4798
6741
7158
6375
6751
5890
4709
4139
6933
1119
1910
55
4923
912
3923
4940
700
812
1385
4657
170
4545
6999
1579
822
5226
2111
279
4674
6901
1616
3440
988
1762
2881
5201
7154
5279
5252
1350
3150
4093
6677
1870
1570
7074
4630
5610
1908
3163
5595
4377
4778
3201
6167
5800
7510
5534
3046
6575
1194
847
887
545
3828
6916
5280
3936
965
462
865
3317
1665
1091
218
3880
5495
1749
2749
3370
4665
1652
1047
2285
6848
7204
4878
2708
2474
7342
6028
6404
6111
4328
6814
383
5928
2993
3917
5026
1688
2603
1082
31
5781
2589
6204
3438
2837
4615
3803
6540
1205
2190
4521
3986
1487
1396
3474
3423
4374
1023
6143
3507
6487
1361
375
4133
4212
7447
6851
3160
7488
5143
4960
2869
2969
7345
4936
2075
5414
2278
6797
7192
4991
1819
1398
1987
1710
4916
2421
3441
4556
6524
5747
2569
5317
5160
2700
4690
134
1660
2795
6156
5057
6636
3660
3953
1635
222
7321
3410
4112
3909
1499
6104
2689
7360
7251
5858
515
1105
188
7535
2828
3134
7453
5396
197
4836
7174
5719
1837
2985
6755
5102
5021
1320
6385
2956
1456
65
6012
781
3915
2895
1085
882
3426
6905
2091
3871
4105
5270
2811
6577
7279
1516
2908
4318
755
83
5077
729
1027
4751
6044
6049
2977
194
5445
1399
4799
6101
5171
7241
7001
1689
3123
5316
3651
2375
2963
4835
6239
924
7401
7252
4288
3506
6804
659
3889
2739
1538
5581
2238
198
2631
5996
3380
7325
3068
4246
7446
6993
6819
3461
3850
2367
2612
5321
4695
5536
4350
2927
6337
2624
4661
1013
4764
2645
5879
1767
5004
5838
2955
1927
6875
5941
5214
5003
1796
1147
3371
517
2122
626
599
2115
6886
1436
5573
45
2818
3386
3541
1496
2070
1098
6910
3044
4192
7374
1743
4846
4828
943
3938
4189
996
3779
7376
3901
2670
3573
6471
6270
664
4
1225
6513
2841
6644
1372
4154
3570
401
6220
6793
1303
6473
6766
1337
6284
6714
3479
1143
4287
6745
3599
4525
1715
4090
5537
574
492
6699
1924
3156
3658
2587
5906
5290
242
797
3712
2810
1954
3087
54
4606
3931
255
5303
1890
3716
5085
2579
6059
4511
776
2613
3818
3992
4449
4663
5606
2964
634
6013
3686
6712
7514
2659
6544
3514
637
2295
4684
3250
6327
5538
6812
5649
5297
5532
1167
3753
2464
7372
1490
7350
414
3690
5868
2898
5039
6488
6510
4731
4592
2416
6791
1301
4020
1090
1035
5764
7255
4323
665
6354
2893
4361
6656
3155
164
5821
7123
3968
7020
1315
772
120
5304
7361
6307
1874
2572
7529
1368
2084
4061
998
1931
2897
4953
4159
792
6709
962
5243
5977
2023
2804
6600
5001
2854
2001
447
4566
354
5504
7216
575
1307
7124
3550
358
3157
5338
1044
1627
6682
7507
4257
2513
289
835
580
3703
2248
6881
1690
6182
2710
5646
846
6365
3153
6684
2541
4830
7232
3172
4734
4303
1325
3069
2677
2301
1502
51
6805
3184
5709
648
5836
3631
2574
3729
319
6624
7413
7512
5463
415
7467
6310
6558
2033
490
3633
4667
6830
6660
6873
6079
652
3564
3780
1672
2428
2966
5988
3983
5976
3066
6286
2289
1330
4036
413
3589
7120
3527
4748
5872
2682
6429
7407
100
6732
5364
5165
7271
5698
1269
3598
1264
6704
7315
4308
1982
204
4337
2430
6722
384
4015
3352
2162
3132
7276
4816
3218
934
7508
1799
2359
5775
5851
3277
4605
4944
5623
838
338
1433
2401
6925
2817
867
7207
3223
4787
227
474
7433
2387
3772
2232
6164
0
5929
6172
6331
6369
507
4949
6661
2164
5984
3329
4610
3139
2064
7058
7473
5961
5622
2085
969
4715
2968
1266
582
3554
4351
6845
4263
1305
7045
928
6555
216
4848
6019
3792
3215
3187
5755
989
7163
3588
7380
1718
14
1648
6671
5433
2319
873
7475
2460
2178
4649
6482
877
7081
484
5437
3088
5780
3730
6770
5535
7368
4978
5773
5154
1554
5314
4083
2204
3609
6948
3457
5661
1010
6749
1124
6195
7080
5855
4765
6415
1708
963
3024
7005
929
440
213
1477
3854
1492
4403
4542
6071
2346
2947
5693
2984
4513
993
7405
6889
1933
4534
4221
3612
5892
1820
7378
6663
2485
5404
1484
3313
5681
4509
2620
6064
1542
3668
2980
5867
4293
2442
3152
607
678
6300
7334
6452
6924
979
2404
2093
649
4462
4352
3843
6392
1042
6218
6951
295
6614
1833
5818
1917
6618
2735
1966
2413
5139
7539
4048
5924
359
2437
594
1299
1608
2089
802
6409
3074
6887
6077
2314
4309
4745
3249
2179
3641
350
4802
4985
5626
6148
2914
1981
6021
2598
1103
3052
6927
6033
3722
5796
2215
669
3985
856
509
2140
2975
7023
7143
4276
5568
5168
6277
1791
1721
3903
1909
6730
6311
261
1227
3720
2
4033
3759
2588
3245
6023
3082
4438
3802
7157
1342
4818
2844
5449
7144
1364
6595
766
1811
7352
3387
6676
5994
1906
3343
6205
5866
3448
2834
4980
3698
2040
5813
4572
3328
7304
6027
6959
5249
2347
72
3259
2731
7504
3428
3253
4744
7297
6788
4653
526
6767
6976
5224
1960
6253
2509
7458
956
2024
6696
1876
17
535
3928
902
1370
4939
1722
1962
5513
3058
2174
3030
978
1054
1026
1776
5630
103
6450
1865
1563
3038
6843
267
6386
1707
221
6275
3465
1187
7337
5360
297
4346
4187
2781
5650
2053
5142
981
5217
7549
4817
5341
1928
6526
3688
7178
518
2444
5469
4059
3628
1857
4178
6462
2643
4760
372
6323
7538
5131
3518
1162
1381
970
833
3120
3868
6472
2709
6853
1243
3165
2213
2262
6058
5450
1757
497
1728
4396
1847
1123
7188
3568
1537
2681
2192
6705
2059
5012
6912
5175
3067
5845
2872
623
2875
6898
2386
6449
113
1609
7259
3083
5153
2479
2952
3782
6827
860
2136
5452
3642
3493
2857
1215
2045
4499
2568
1130
2131
1080
4797
2116
6786
118
1618
5831
4719
1561
620
6831
2048
1589
143
272
2087
5809
903
449
482
6894
7339
1534
6091
382
4880
5795
5458
3583
5735
3765
7498
1070
1149
1338
5863
7495
6601
557
1296
15
1290
5969
1196
782
2241
400
1875
6478
2058
3601
1817
6348
2438
5936
2519
3190
6531
4024
5727
6244
6010
2939
895
5232
3463
25
4404
5959
5177
1128
6479
6370
834
4921
6105
5947
5998
6178
4163
7460
4226
2915
6006
3311
1677
3274
4770
7194
5393
4389
2577
1189
2146
3674
6591
6615
1464
3513
1726
5748
5344
502
704
2106
5902
4383
40
6259
5062
6674
2257
1088
2861
1604
1880
2022
3529
1950
986
6391
5565
504
2518
746
7203
6396
4019
5884
2768
6426
335
831
59
7438
2429
3207
4560
7029
1000
7523
866
2095
1447
1829
4402
4740
5388
3239
446
681
5490
5056
7133
7299
2550
47
5179
4882
2752
3521
3723
2388
3115
3146
4437
1596
159
3645
3530
49
1248
5768
716
98
3967
1948
1619
4849
2142
5148
1564
4970
997
1523
393
3884
1233
5353
732
3365
491
5508
3537
3863
1628
3427
4928
7412
5531
5878
558
5770
2742
3870
4157
2478
7358
4660
2218
6518
1001
6879
1327
5629
4331
4906
5151
5700
4767
6087
1238
2250
5096
3089
3399
302
4079
389
1431
5683
2449
2592
2144
1084
5671
6136
1150
6664
5294
3515
2653
3596
314
4681
4161
3888
6266
336
391
1457
6113
6969
3209
7148
5048
6796
5815
6278
2549
2704
4935
2693
4214
5457
7476
3482
1172
2962
6574
3342
1969
4386
4842
5869
2900
4114
7033
5521
7006
1784
2609
7278
6645
6946
1750
6241
234
6221
602
3544
4372
1735
4356
1901
6935
1099
6516
2894
1934
6506
7234
7055
5604
4497
2236
554
56
3496
1944
1883
5278
6930
186
886
4540
4363
4038
1116
3339
5982
5492
1204
6330
1651
5236
4432
5172
3436
5707
6201
6303
6171
1978
5281
1279
195
344
6532
4130
724
5923
7048
6998
7070
412
4348
3216
3072
917
3262
6085
5950
5063
3349
5905
2109
1161
5038
1292
6491
798
3700
3613
7137
4517
2340
5097
2141
3385
2796
7014
3630
450
6188
1907
2412
3693
4750
2461
1319
1409
7078
5799
2062
1031
1244
5567
303
6051
951
5614
11
4275
793
1731
4315
687
1100
7484
3954
6470
4673
6152
1460
6265
4761
6269
403
4872
5608
2180
6802
4335
1079
765
42
7210
4165
759
5673
2185
3063
2564
294
4749
192
3425
4895
2417
1504
2663
4444
6371
6108
1904
3545
3717
1083
604
6908
3229
4273
5176
1152
1221
1748
6728
6836
2205
1569
4446
1134
6533
1072
7131
1377
3650
2027
6888
5901
5205
1481
248
4205
1831
4986
6115
6801
3876
4530
6276
4414
7262
2674
5612
4814
7332
1834
2755
7477
4065
7306
5763
470
3213
2791
6464
1274
206
2132
7311
5027
3775
6355
795
4999
339
1050
1258
3095
6585
4510
6562
4155
7389
4943
2933
2187
7088
668
1166
5603
6567
4060
745
2535
4054
3466
3766
4990
4087
3017
442
176
3222
5594
7280
3407
5395
5871
5035
6062
6549
1925
4795
3039
2472
2221
1236
968
6437
6620
3536
2004
2149
3594
2638
3358
1425
1061
2265
3002
904
2730
2384
6230
1313
3701
1996
1861
5724
2832
2321
2932
471
3347
2838
6302
5075
378
4310
5447
1379
3293
1192
4482
1362
5638
4909
157
4116
6678
3230
2999
4658
4376
5569
4341
7170
2139
2720
6406
2463
136
3771
3101
1725
2042
6332
1571
3556
6232
3396
1068
7219
5642
5782
737
2546
774
1744
2293
2182
410
6734
3007
6594
7231
5806
5241
6273
5526
5250
3621
6563
5398
2539
180
4439
6966
1195
3093
6197
4160
5645
1617
202
591
2919
2318
1770
3942
5386
4516
6557
718
2135
697
587
7424
7410
3018
4713
1459
2998
4794
495
1329
1259
5423
2901
642
3419
3266
426
6481
1104
1282
3994
5933
5029
6367
7355
3619
560
1408
733
6981
6399
3552
6985
4349
5367
760
992
1614
3586
2275
4137
845
6274
5330
3354
1900
3553
296
5475
2108
39
1521
1990
1858
5560
5193
7270
3678
3384
2276
4118
5416
2076
3377
1206
6422
4124
4785
2240
1613
1983
304
4417
1405
348
3164
6931
6283
3682
1036
7317
2524
3683
4487
1760
3614
4149
468
2656
271
90
4611
995
4408
2409
6711
5752
2611
7347
1941
7274
2270
2313
7518
523
2767
4081
4810
18
6097
5578
6149
3504
5429
2904
1037
1943
1703
5127
2547
1434
6117
3145
6078
1506
2751
7528
7066
274
1360
6635
2282
3919
785
3882
4612
4302
5917
5400
7248
328
3433
3203
4947
110
7172
5957
6486
7235
657
2593
6499
5953
6389
3096
3788
5434
454
7097
1578
1415
1129
7246
6564
4982
520
3170
3561
2482
5132
3315
7308
2628
107
2831
613
7092
5551
4238
7500
1078
33
5965
4267
651
1086
7525
5212
4050
3081
505
2696
1030
1006
828
3130
5550
2447
5784
5694
3244
2570
5158
3812
5498
6489
2361
2715
4933
6213
6215
2366
428
6161
356
2434
6790
7465
4078
1341
438
1549
451
6098
2200
3226
3109
7291
385
7215
6345
2554
4636
5628
5680
5753
3272
273
933
3899
3644
1592
1830
6257
6896
6764
1793
1392
5875
1603
7086
2220
1038
2685
6799
616
783
2094
5919
4470
4316
483
1401
193
4974
927
3906
1197
1163
658
635
6945
2120
6122
5710
5514
3188
6083
6961
4640
1416
3563
2194
3786
7206
4188
1556
2824
6427
1388
7049
7111
3359
6282
4593
1429
1122
6223
3542
5885
171
7353
2679
6629
5110
7439
1094
533
796
3647
3353
1339
6979
911
5828
3752
2552
6936
7307
2020
6794
5295
3434
1669
6817
2304
7269
647
1479
6455
6179
758
57
1812
3724
2976
292
2799
1649
4582
2994
7244
5963
5326
6309
1127
1102
2697
5853
4433
6860
1745
5774
5123
5509
6994
3495
7041
5173
4577
5342
4850
5674
2950
6344
7474
7448
2533
3707
4553
5319
2326
5474
1471
6129
7487
3929
6857
5418
7189
3839
4650
1289
2153
4951
3121
628
7411
3524
6977
7533
2473
3900
1964
4546
3185
7004
2850
127
4762
2511
6088
1894
1034
4549
3502
6911
3558
6474
571
3960
4392
4369
5862
2996
1334
3372
199
1533
4853
1467
6388
1845
5370
5783
3768
4333
751
7116
4461
7540
5720
1389
4735
1135
3414
6900
4301
5
5413
4717
5054
5659
5275
6160
1335
1634
2706
672
4136
281
3122
4262
6690
6412
5575
124
5666
2553
1602
1841
4424
6495
7542
3489
4473
1114
6306
85
946
3140
286
3697
6034
7428
3689
4228
3219
1678
6387
6637
6762
6029
1297
524
1207
6522
5405
424
3167
5636
3820
6043
5523
407
6054
710
2997
843
6854
4106
7091
6608
3260
5011
3831
138
844
5894
3348
2398
4198
1393
6514
937
4520
2866
568
3584
5380
6217
7260
2469
2529
1683
4074
1611
5185
229
3124
3956
3576
7496
6035
2623
1835
6648
5420
5758
2157
2476
4150
4495
418
1351
52
5034
3059
4066
5372
1257
5722
6225
830
81
4448
435
5652
2103
6319
1118
1151
5318
7182
5050
6466
6685
1769
6841
3473
253
3073
2264
5776
2411
425
4957
1273
6414
6771
1171
7008
259
6231
2774
4646
6630
2599
6803
3374
4456
376
5421
2129
1430
1687
1734
6625
6957
7281
948
5881
6971
4879
6421
4724
3498
5624
5777
4022
6040
6909
4122
5577
2604
3078
4637
1781
5967
7293
3129
2816
2219
4776
5081
3949
6703
4435
4696
1237
7397
4518
2395
417
1175
2876
3932
6294
2137
1125
6133
60
1529
6447
6972
4097
2348
2606
1465
4573
2942
2973
4202
1891
3973
5296
2032
3872
869
1691
7043
6811
4536
1893
7264
5850
444
2003
4357
4384
4080
3280
4831
6469
456
7479
6308
275
1452
4585
6432
5596
4375
76
5586
4345
1957
6507
622
2864
4378
5417
1843
4672
3080
4088
3402
5995
2400
6326
4043
3290
2312
4353
3118
2227
4319
561
4905
3406
5329
5067
1568
2954
6055
2281
2676
7243
6260
780
4937
5409
5696
2918
102
2422
4837
2351
5480
3951
3233
7275
1112
3567
1395
1463
1406
3560
1866
1407
4230
5564
5114
3982
685
2809
921
3178
5916
6116
73
1136
2563
3303
530
5335
3984
5778
6084
5679
2886
1838
1766
5167
7366
6825
3487
4710
6862
5891
3454
721
1993
3500
4887
5137
7326
3468
4018
4711
4326
3638
1824
5644
1174
1097
1898
2256
1
6607
2813
5247
6850
463
7290
3023
5544
5713
804
6798
6493
6166
3806
3681
4010
5756
2105
4145
6150
3930
4488
41
907
563
1971
5657
264
3734
7117
3494
976
4274
3283
3764
6809
6042
583
2505
3443
569
5272
3958
6604
30
4413
1620
5730
3071
1936
6823
7214
3350
2711
2882
3555
5397
66
5716
1113
4666
2833
4406
4898
3332
6338
5825
353
3819
2363
2930
3344
1376
129
2247
2847
1332
2652
6139
5972
1853
4072
4290
2756
3608
2335
1846
684
475
4146
1961
3472
36
7265
2381
7212
4035
2000
1809
1106
4115
2197
6748
5530
3565
5476
1848
472
913
2005
5903
3323
2403
322
1723
5669
1919
5087
61
3316
1610
5456
2953
4225
2714
3607
3006
1158
6761
1067
3667
1956
4728
4759
5559
1179
3859
5407
3256
2986
3784
598
6902
671
6835
2457
6434
111
7391
7077
2760
146
1186
4215
2210
7515
2435
3337
4806
3523
156
2514
2626
2290
7253
37
6291
1326
2383
2195
35
1333
7421
5874
500
5651
3894
2855
6254
2508
4151
3467
64
5216
1629
207
7409
53
1261
6224
4347
6939
6333
1216
6032
4070
4028
5244
2280
5065
399
3301
6390
5368
6587
775
2725
3119
6249
6468
5711
6243
5888
7249
7094
6839
938
5935
142
97
1093
4055
1624
3606
4543
214
6047
1055
1530
5122
1694
5896
2309
4365
2717
4822
2177
4381
7028
4234
5200
4135
3664
122
3297
4575
4428
1580
386
6304
3005
4522
6634
3054
4623
7256
4984
5298
6214
881
5410
6356
6773
1234
6030
4107
5207
6566
3890
7113
5539
125
2591
2542
3042
2448
360
5024
5741
3306
2827
379
404
5014
4156
2050
4258
3777
3866
2127
3585
7471
397
6655
4694
516
673
6267
2299
2273
4743
4529
5670
4992
5656
5174
1816
4199
6599
332
6289
7000
2291
288
6550
7267
3437
3199
6576
5737
4654
7393
1662
6866
1154
6713
3261
88
5886
4180
6784
916
5415
942
566
5589
879
2814
2202
3379
511
5999
2315
2823
6539
6820
6103
2797
4786
6670
589
2951
6760
6328
7018
619
7208
4261
2910
1867
6272
910
610
679
1033
7230
5856
7201
4385
3814
3022
6045
1582
3142
7286
6679
4329
4415
2124
1737
1300
7238
6547
643
5927
6849
6568
5675
183
1995
1777
6280
1357
743
2820
6413
777
6147
6360
6057
3962
48
5301
1968
1560
1832
6535
2737
4870
5691
3842
6545
4170
6989
4808
5830
4914
3791
900
4042
6378
5239
6967
2117
609
1911
2112
705
6667
2949
2114
4049
4489
357
2431
82
1443
6973
6725
3291
5978
5497
3695
1729
4975
1636
1371
2332
6694
4844
2761
6408
7445
219
4746
4068
5311
6162
2086
7463
617
4240
6921
3242
6185
5918
2561
6740
5689
811
5432
3036
5958
5816
763
1165
3375
2322
3180
6561
3808
7061
5742
6960
6155
2573
5971
5488
3056
3655
3189
1343
2224
473
2686
5325
859
6997
5203
1312
6928
178
6379
5500
1400
6920
5008
1951
7090
6109
7034
243
4468
6467
1397
4841
1922
6180
5529
1059
2245
739
935
863
7149
6662
1403
1684
44
1600
6806
7165
5078
5734
236
4815
1657
3643
4064
1056
7450
2907
2370
1455
362
4338
4201
3781
1410
1567
4584
4514
21
7102
6872
3726
479
1892
3927
3721
4110
531
3913
6102
489
2688
5337
5459
1298
7517
6255
2610
3617
6263
1283
5723
3848
5468
3944
4685
1794
3747
3322
3104
5466
6808
6747
4675
6072
1765
5487
203
135
2251
3263
7112
2298
1348
2054
2789
212
1851
2595
3533
6242
63
3666
4063
7050
5854
2441
4758
3699
922
6560
3240
5070
3591
3955
5116
519
5592
4730
4223
4809
6251
2695
2979
5036
1959
6341
7303
3346
6463
1763
5501
6605
1375
436
2859
7417
7394
6137
5324
4981
1519
3279
7068
3175
299
689
4447
1291
7301
2931
6892
6613
5552
6503
930
4152
6610
1594
944
4971
3710
2627
7516
3762
2586
1294
528
2451
1828
5349
6895
3302
2330
6724
7104
4292
3634
5699
1235
6003
6505
70
4285
5545
7418
1599
625
2353
3763
4183
3539
1810
1792
3751
2039
7502
2848
2607
4983
2575
4621
3289
7316
311
5076
1574
5793
291
2504
7220
4324
3126
3212
1545
1386
6956
1255
4196
1915
1211
6250
2602
2119
5191
3294
1646
7237
5942
4370
1842
548
6417
2341
4312
2527
6039
5389
876
1185
161
932
2887
6708
3702
1168
4700
4908
1805
1265
6
1293
6768
7166
4465
1999
787
2406
3
2214
5443
6145
5287
6146
4603
577
1720
5436
1699
1441
6884
674
3878
3851
3393
4422
2433
2079
3305
7318
2166
1637
5876
373
567
7532
5052
7125
6140
841
1991
1480
618
5259
4996
6316
2582
6359
6268
29
5541
706
2016
147
2909
5761
5453
7059
3102
4973
5049
2632
4340
3034
564
4629
6075
1270
5378
3885
3826
2879
4838
200
6702
3195
2925
2082
2407
5373
2732
2699
1881
1394
2165
5170
7087
7481
5542
4871
5302
310
1992
6720
7499
4296
6846
4587
4775
5732
1081
368
5951
3107
7035
2051
3243
1214
1020
3799
7335
3672
5766
624
3892
2283
2017
5692
1475
396
6598
6665
5633
6475
5117
5111
861
3194
467
4948
3079
4332
4670
4967
1606
7343
7186
117
153
265
7191
1213
4360
4084
4864
3829
1164
3653
480
3833
5251
874
2432
3879
6565
3691
5609
7416
3785
6672
351
2499
7305
2738
254
4086
301
3444
7261
738
4046
5195
330
3841
3045
5427
1775